experiments/01_simple_laminar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

// Run for ~10 s — well beyond the viscous diffusion time (r²/nu ≈ 7.6 s)
// so the Poiseuille profile is fully established throughout the tube.
endTime         10;

// deltaT = 0.01 s  →  Courant = U*dt/dx = 0.1*0.01/0.005 = 0.2  (< 1 ✓)
deltaT          0.01;

writeControl    runTime;
writeInterval   1;          // save a snapshot every 1 s → 10 output times

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
